W8D1/bench_bnb/app/controllers/application_controller.rb

  def current_user
    User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "qboKt0Mi-svfdpb9VZfYSg"], ["LIMIT", 1]]