W8D1/bench_bnb/app/models/user.rb

  def self.find_by_credentials(username, passed_word)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jay"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "DJ1AiLrQXxOH67VuiTEE1w"], ["updated_at", "2018-11-09 20:32:21.039314"], ["id", 1]]