W3D3/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = ? LIMIT ?  [["short_url", "g9UI0HJinnYTXzho1-TTWA"], ["LIMIT", 1]]
---
  def self.random_code
    short_url_code = SecureRandom.urlsafe_base64
    while ShortenedUrl.exists?(short_url_code)

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id") VALUES (?, ?, ?)  [["short_url", "g9UI0HJinnYTXzho1-TTWA"], ["long_url", "http://www.zoomquilt.org/"], ["user_id", 1]]
---
  def self.create_short_url(user,long_url_str)
    short_url_str = ShortenedUrl.random_code

    ShortenedUrl.create!(
      short_url: short_url_str,
      long_url: long_url_str,
      user_id: user.id
    )