W3D3/URLShortener/app/models/visit.rb

  def self.record_visit!(user, shortened_url)
    self.create!(user_id: user.id, shortened_url_id: shortened_url.id)
---
INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["shortened_url_id", 1], ["created_at", "2018-10-10 21:29:54.349466"], ["updated_at", "2018-10-10 21:29:54.349466"]]