W7D5/bench_bnb/app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])